#Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

day = input()
if day == "1":
    print("no")
if day == "2":
    print("no")
if day == "3":
    print("no")
if day == "4":
    print("no")
if day == "5":
    print("no")
if day == "6":
    print("YES")
if day == "7":
    print("YEEEES")

